{"type":"data","nodes":[null,{"type":"data","data":[{"content":1},"\n\u003Ch1>Professional Diploma in Marketing (Level 4)\u003C/h1>\n\u003Cp>\u003Cstrong>\u003Cu>West Coast International Institute Policy Statements\u003C/u>\u003C/strong>\u003C/p>\n\u003Cp>It is the responsibility of every student to familiarize themselves with the academic and general policies of the college. Copies of the college’s policies can be obtained from the administrative office or from the college website.\u003C/p>\n\u003Cp>It is the policy of WCII to create an environment that is safe and healthy for our staff, students, visitors, suppliers, contractors, and the community through the implementation of policies and procedures designed to achieve the highest possible standards.\u003C/p>\n\u003Cp>\u003Cstrong>\u003Cem>Attendance\u003C/em>\u003C/strong>\u003Cstrong>: \u003C/strong>All classes, workshops, and examinations are compulsory and you are expected to attend unless you have good reason to be absent. Attendance is monitored and a register is taken. We expect every student to abide by the College rules and regulations. For details please refer to our non-attendance policy.\u003C/p>\n\u003Cp>\u003Cstrong>\u003Cem>Punctuality:\u003C/em>\u003C/strong> You are expected to turn up to all timetable sessions on time. If you are late, the tutor has the right to refuse entry to minimize disruption to the other students.\u003C/p>\n\u003Cp>\u003Cstrong>&nbsp;\u003Cem>Sickness and Absence\u003C/em>\u003C/strong>\u003Cstrong>: \u003C/strong>All absence is to be reported to the Course Coordinator or teacher. This is important to ensure your record of attendance is not affected. But for any reason, supporting evidence must be provided in order to approve your absence. For more details please refer to the College Hand Book.\u003C/p>\n\u003Cp>\u003Cstrong>\u003Cem>\u003Cu>Classroom Regulations:\u003C/u>\u003C/em>\u003C/strong>\u003C/p>\n\u003Cul>\n\u003Cli>All students are expected to dress properly in the classroom\u003C/li>\n\u003Cli>Students are not permitted to leave the classroom for any reason without the teacher’s approval during lectures.\u003C/li>\n\u003Cli>Students should carry all relevant materials (Lecture notes/materials, notebook, and pens) to class.\u003C/li>\n\u003Cli>\u003Cstrong>All mobile phones should be switched off during lectures. \u003C/strong>\u003C/li>\n\u003Cli>Food, drink, and gum chewing are not allowed during lectures.\u003C/li>\n\u003Cli>All college regulations should be followed, failure to abide by the above policies will lead to disciplinary.\u003C/li>\n\u003C/ul>\n\u003Cp>\u003Cstrong>\u003Cem>Plagiarism: \u003C/em>\u003C/strong>you are reminded that all work submitted as part of the requirements for any examination (including coursework) must be expressed in your own words and incorporate your own ideas and judgments. Plagiarism, which is the presentation of another person’s thoughts or words as though they were your own, must be avoided with particular care in coursework, essays, and reports. If a student is found guilty of plagiarism, his/her assignment will not be marked at all.\u003C/p>\n\u003Cp>Many students feel pressured to complete papers well and quickly, and with the accessibility of new technology (the Internet) students can plagiarize by copying and pasting information from other sources. This is often easily detected by teachers, for several reasons. First, students’ choice of sources is frequently unoriginal; instructors may receive the same passage copied from a popular source from several students. Second, it is often easy to tell whether students used their own “words.” Third, students may choose sources that are inappropriate, off-topic, or contain incorrect information. In the academic world, plagiarism by students is a very serious offense that can result in punishments such as a failing grade on a particular assignment (typically at the college or university level).\u003C/p>\n\u003Cp>\u003Cstrong>WCII is using software (Plagiarism Checker). This is to ensure that works submitted by students are free from plagiarism.\u003C/strong>\u003C/p>\n\u003Cp>Text Books, Journals, Articles, and other learning materials\u003C/p>\n\u003Cp>Students can access the learning materials (Textbooks, Articles, Journals, etc) through the college computers by using their password login. These learning materials can be accessed with or without the internet.\u003C/p>\n\u003Cp>Students can also borrow books from the college library. These books can be borrowed for a period of not more than one week since other students might be waiting for them.\u003C/p>\n\u003Cp>\u003Cstrong>Learning and teaching&nbsp;strategies used to enable the achievement of learning outcomes:\u003C/strong>\u003C/p>\n\u003Cp>Learning takes place through lectures, interactive, class discussions, groups, problem reviews, and situational analysis.&nbsp; Both formal and informal lectures provide knowledge, skills, and understanding. Students are actively encouraged to form study groups and participate fully at all times and also discuss course topics and material which foster a greater depth of understanding and learning experience.\u003C/p>\n\u003Cp>\u003Cstrong>\u003Cu>Qualification Information\u003C/u>\u003C/strong>\u003C/p>\n\u003Cp>\u003Cstrong>(PD) Professional Diploma in Marketing \u003C/strong>\u003C/p>\n\u003Cp>The Professional Diploma in Marketing is regulated by (NAQAA) National Accreditation and Quality Assurance Authority in the Gambia. The qualification is awarded by EduQual in The United Kingdom.\u003C/p>\n\u003Cp>\u003Cstrong>Qualification Objective\u003C/strong>\u003C/p>\n\u003Cp>The programme is designed to help students to develop knowledge, skills, and understanding in the area of marketing. As most students at this level are highly mature, hence the designation of this program at the Professional Diploma level is meant to develop the students with the required skills and capability in order to excel in the Advanced Professional Diploma and also be able to devise and execute tactical marketing activities.\u003C/p>\n\u003Cp>\u003Cstrong>Entry requirement-\u003C/strong>\u003C/p>\n\u003Cul>\n\u003Cli>ICC Introductory Certificate\u003C/li>\n\u003Cli>GCE/GCSE/WASSCE With a minimum of 5 Credits including English and Math\u003C/li>\n\u003Cli>Any other relevant qualifications\u003C/li>\n\u003Cli>Applicants must demonstrate competence in English Language\u003C/li>\n\u003C/ul>\n\u003Cp>\u003Cstrong>&nbsp;Course Duration\u003C/strong>–&nbsp;&nbsp; 1 year\u003C/p>\n\u003Cp>\u003Cstrong>&nbsp;Units structure of the qualification, Level, and Credit value\u003C/strong>\u003C/p>\n\u003Ctable>\n\u003Ctbody>\n\u003Ctr>\n\u003Ctd>\u003Cstrong>&nbsp; Unit Code\u003C/strong>\u003C/td>\n\u003Ctd>\u003Cstrong>P\u003C/strong>\u003Cstrong>rofessional Diploma in Marketing\u003C/strong>\u003C/td>\n\u003Ctd>\u003Cstrong>level\u003C/strong>\u003C/td>\n\n\u003Ctd>\u003Cstrong>C\u003C/strong>\u003Cstrong>redit \u003C/strong>\u003Cstrong>Value\u003C/strong>\u003C/td>\n\u003C/tr>\n\u003Ctr>\n\u003Ctd>&nbsp; MK4BE\u003C/td>\n\u003Ctd>Business Writing Skills\u003C/td>\n\u003Ctd>Level 4\u003C/td>\n\n\u003Ctd>15\u003C/td>\n\u003C/tr>\n\u003Ctr>\n\u003Ctd>&nbsp; MK4PM\u003C/td>\n\u003Ctd>Principles of Marketing\u003C/td>\n\u003Ctd>Level 4\u003C/td>\n\n\u003Ctd>15\u003C/td>\n\u003C/tr>\n\u003Ctr>\n\u003Ctd>&nbsp; MK4PA\u003C/td>\n\u003Ctd>Promotion and Advertising\u003C/td>\n\u003Ctd>Level 4\u003C/td>\n\n\u003Ctd>15\u003C/td>\n\u003C/tr>\n\u003Ctr>\n\u003Ctd>&nbsp;MK4CS\u003C/td>\n\u003Ctd>Customer Service\u003C/td>\n\u003Ctd>Level 4\u003C/td>\n\n\u003Ctd>15\u003C/td>\n\u003C/tr>\n\u003Ctr>\n\u003Ctd>&nbsp;MK4IBC\u003C/td>\n\u003Ctd>International Business Communications\u003C/td>\n\u003Ctd>Level 4\u003C/td>\n\n\u003Ctd>15\u003C/td>\n\u003C/tr>\n\u003Ctr>\n\u003Ctd>&nbsp;MK4MP\u003C/td>\n\u003Ctd>Marketing Planning\u003C/td>\n\u003Ctd>Level 4\u003C/td>\n\n\u003Ctd>15\u003C/td>\n\u003C/tr>\n\u003Ctr>\n\u003Ctd>&nbsp;MK4SSM\u003C/td>\n\u003Ctd>Selling and Sales Management\u003C/td>\n\u003Ctd>Level 4\u003C/td>\n\n\u003Ctd>15\u003C/td>\n\u003C/tr>\n\u003Ctr>\n\u003Ctd colspan=\"4\">\u003Cstrong>&nbsp;Total Credits Value\u003C/strong>\u003C/td>\n\u003Ctd>\u003Cstrong>105\u003C/strong>\u003C/td>\n\u003C/tr>\n\u003C/tbody>\n\u003C/table>\n\u003Cp>\u003Cstrong>Assessment Grades and Methods\u003C/strong>\u003C/p>\n\u003Cul>\n\u003Cli>Grade A- Distinction 70% and above\u003C/li>\n\u003Cli>Grade B- Credit 60% to 69%\u003C/li>\n\u003Cli>Grade C- Pass 50% to 59%\u003C/li>\n\u003Cli>Grade D- Marginal Pass 40% to 49%\u003C/li>\n\u003Cli>Grade F- Fail 39% and under\u003C/li>\n\u003C/ul>\n\u003Ctable>\n\u003Ctbody>\n\u003Ctr>\n\u003Ctd>Assessment Methods\u003C/td>\n\u003Ctd>Marks\u003C/td>\n\u003C/tr>\n\u003Ctr>\n\u003Ctd>Exam\u003C/td>\n\u003Ctd>40%\u003C/td>\n\u003C/tr>\n\u003Ctr>\n\u003Ctd>Assignments\u003C/td>\n\u003Ctd>60%\u003C/td>\n\u003C/tr>\n\u003Ctr>\n\u003Ctd>Total\u003C/td>\n\u003Ctd>100%\u003C/td>\n\u003C/tr>\n\u003C/tbody>\n\u003C/table>"],"uses":{"params":["program","course"]}}]}
