{"type":"data","nodes":[null,{"type":"data","data":[{"content":1},"\u003Ch1 style=\"text-align: justify;\">Advanced Professional Diploma in Accounting and Finance (Level 5)\u003C/h1>\n\u003Cp style=\"text-align: justify;\">\u003Cstrong>\u003Cu>West Coast International Institute Policy Statements\u003C/u>\u003C/strong>\u003C/p>\n\u003Cp style=\"text-align: justify;\">It is the responsibility of every student to familiarize themselves with the academic and general policies of the college. Copies of the college’s policies can be obtained from the administrative office of the college.\u003C/p>\n\u003Cp style=\"text-align: justify;\">It is the policy of WCII to create an environment that is safe and healthy for our staff, students, visitors, suppliers, contractors, and neighbours through the implementation of policies and procedures designed to achieve the highest possible standards.\u003C/p>\n\u003Cp style=\"text-align: justify;\">\u003Cstrong>\u003Cem>Attendance\u003C/em>\u003C/strong>\u003Cstrong>: \u003C/strong>All classes, workshops, and examinations are compulsory and you are expected to attend unless you have good reason to be absent. Attendance is monitored and a register is taken. We expect every student to abide by the College rules and regulations. For details please refer to our non-attendance policy.\u003C/p>\n\u003Cp style=\"text-align: justify;\">\u003Cstrong>\u003Cem>Punctuality:\u003C/em>\u003C/strong> You are expected to turn up to all timetable sessions on time. If you are late, the tutor has the right to refuse entry in an effect to minimize disruption to the other students.\u003C/p>\n\u003Cp style=\"text-align: justify;\">\u003Cstrong>&nbsp;\u003Cem>Sickness and Absence\u003C/em>\u003C/strong>\u003Cstrong>: \u003C/strong>All absence is to be reported to the Course Coordinator or teacher. This is important to ensure your record of attendance is not affected. But for any reason, supporting evidence must be provided in order to approve your absence. For more details please refer to the College Hand Book.\u003C/p>\n\u003Cp style=\"text-align: justify;\">\u003Cstrong>\u003Cem>\u003Cu>Classroom Regulations:\u003C/u>\u003C/em>\u003C/strong>\u003C/p>\n\u003Cul style=\"text-align: justify;\">\n\u003Cli>All students are expected to dress properly in the classroom\u003C/li>\n\u003Cli>Students are not permitted to leave the classroom for any reason without the teacher’s approval during lectures.\u003C/li>\n\u003Cli>Students should carry all relevant materials (Lecture notes/materials, notebook, and pens) to class.\u003C/li>\n\u003Cli>\u003Cstrong>All mobile phones should be switched off during lectures. \u003C/strong>\u003C/li>\n\u003Cli>Food, drink and gum chewing are not allowed during lectures.\u003C/li>\n\u003Cli>All college regulations should be followed, failure to abide by the above policies will lead to disciplinary.\u003C/li>\n\u003C/ul>\n\u003Cp style=\"text-align: justify;\">\u003Cstrong>\u003Cem>Plagiarism: \u003C/em>\u003C/strong>you are reminded that all work submitted as part of the requirements for any examination (including coursework) must be expressed in your own words and incorporate your own ideas and judgments. Plagiarism, which is the presentation of another person’s thoughts or words as though they were your own, must be avoided with particular care in coursework, essays, and reports. If a student is found guilty of plagiarism, his/her assignment will not be marked at all.\u003C/p>\n\u003Cp style=\"text-align: justify;\">Many students feel pressured to complete papers well and quickly, and with the accessibility of new technology (the Internet) students can plagiarize by copying and pasting information from other sources. This is often easily detected by teachers, for several reasons. First, students’ choice of sources is frequently unoriginal; instructors may receive the same passage copied from a popular source from several students. Second, it is often easy to tell whether a student used their own “words.” Third, students may choose sources that are inappropriate, off-topic, or contain incorrect information. In the academic world, plagiarism by students is a very serious offense that can result in punishments such as a failing grade on a particular assignment (typically at the college or university level).\u003C/p>\n\u003Cp style=\"text-align: justify;\">\u003Cstrong>West Coast International Institute is using software (Plagiarism Checker). This is to ensure that works submitted by students are free from plagiarism.\u003C/strong>\u003C/p>\n\u003Ch3 style=\"text-align: justify;\">\u003Cu>Text Books, Journals, Articles, and other learning materials\u003C/u>\u003C/h3>\n\u003Cp style=\"text-align: justify;\">Students can access the learning materials (Textbooks, Articles, Journals etc) through the college computers by using their password login. These learning materials can be accessed with or without the internet.\u003C/p>\n\u003Cp style=\"text-align: justify;\">Students can also borrow books from the college library. These books can be borrowed for a period of not more than one week since other students might be waiting for them.\u003C/p>\n\u003Cp style=\"text-align: justify;\">\u003Cstrong>\u003Cu>Learning and teaching&nbsp;strategies used to enable the achievement of learning outcomes:\u003C/u>\u003C/strong>\u003C/p>\n\u003Cp style=\"text-align: justify;\">Learning takes place through lectures, interactive, class discussions, groups, problem reviews, and situational analysis.&nbsp; Both formal and informal lectures provide knowledge, skills and understanding. Students are actively encouraged to form study groups and participate fully at all times and also discuss course topics and material which foster a greater depth of understanding and learning experience.\u003C/p>\n\u003Cp style=\"text-align: justify;\">\u003Cstrong>Qualification Information\u003C/strong>\u003C/p>\n\u003Cp style=\"text-align: justify;\">\u003Cstrong>(APD) Advanced Professional Diploma in Accounting and Finance \u003C/strong>\u003C/p>\n\u003Cp style=\"text-align: justify;\">The (APD) Advanced Professional Diploma in Accounting and Finance is regulated by (NAQAA) National Accreditation and Quality Assurance Authority in the Gambia. The qualification is awarded by EduQual in the United Kingdom.\u003C/p>\n\u003Cp style=\"text-align: justify;\">\u003Cstrong>Qualification Objective\u003C/strong>\u003C/p>\n\u003Cp style=\"text-align: justify;\">The course provides the essential information and skills necessary for professionals who have to make decisions that are important to the direction and performance of an organization. It gives the underlying principles and concepts of financial accounting in the context of how accounting fits into the contemporary business environment. Students will learn how accounting functions as an information development and communication system that support economic decision-making and provides value to entities and society. The student will discover the uses and limitations of financial statements and related information and apply analytical tools in making both business and financial decisions.\u003C/p>\n\u003Cp style=\"text-align: justify;\">The programme is assessed through different methods which include assignments, exams, group presentations, etc. Most of the learning is built practically in response to real-world situations.\u003C/p>\n\u003Cp style=\"text-align: justify;\">\u003Cstrong>&nbsp;Entry requirement-\u003C/strong>\u003C/p>\n\u003Cul style=\"text-align: justify;\">\n\u003Cli>Professional Diploma\u003C/li>\n\u003Cli>GCE/GCSE/WASSCE With a minimum of 5 Credits including math\u003C/li>\n\u003Cli>Any other relevant qualifications\u003C/li>\n\u003Cli>Applicants must demonstrate competence in English Language\u003Cstrong>\u003Cbr>\n\u003C/strong>\u003C/li>\n\u003C/ul>\n\u003Cp style=\"text-align: justify;\">\u003Cstrong>Course duration\u003C/strong>–&nbsp;&nbsp; 1 year\u003C/p>\n\u003Cp style=\"text-align: justify;\">\u003Cstrong>Units structure of the qualification, Level, and Credit value \u003C/strong>\u003C/p>\n\u003Ctable style=\"height: 387px;\">\n\u003Ctbody>\n\u003Ctr>\n\u003Ctd>\u003Cstrong>Unit Code\u003C/strong>\u003C/td>\n\u003Ctd>\u003Cstrong>Advanced Professional Diploma Accounting &amp; Finance\u003C/strong>\u003C/td>\n\u003Ctd>\u003Cstrong>level\u003C/strong>\u003C/td>\n\n\u003Ctd>\u003Cstrong>Cre\u003C/strong>\u003Cstrong>dit \u003C/strong>\u003Cstrong style=\"font-size: revert; font-family: inherit; color: initial;\">Value\u003C/strong>\u003C/td>\n\u003C/tr>\n\u003Ctr>\n\u003Ctd>AF5FR\u003C/td>\n\u003Ctd>Financial Reporting\u003C/td>\n\u003Ctd>Level 5\u003C/td>\n\n\u003Ctd>15\u003C/td>\n\u003C/tr>\n\u003Ctr>\n\u003Ctd>AF5FA\u003C/td>\n\u003Ctd>Financial Auditing\u003C/td>\n\u003Ctd>Level 5\u003C/td>\n\n\u003Ctd>15\u003C/td>\n\u003C/tr>\n\u003Ctr>\n\u003Ctd>AF5T\u003C/td>\n\u003Ctd>Taxation\u003C/td>\n\u003Ctd>Level 5\u003C/td>\n\n\u003Ctd>15\u003C/td>\n\u003C/tr>\n\u003Ctr>\n\u003Ctd>AF5CF\u003C/td>\n\u003Ctd>Corporate Finance\u003C/td>\n\u003Ctd>Level 5\u003C/td>\n\n\u003Ctd>15\u003C/td>\n\u003C/tr>\n\u003Ctr>\n\u003Ctd>AF5FPC\u003C/td>\n\u003Ctd>Financial Planning and Control\u003C/td>\n\u003Ctd>Level 5\u003C/td>\n\n\u003Ctd>15\u003C/td>\n\u003C/tr>\n\u003Ctr>\n\u003Ctd>AF5ECE\u003C/td>\n\u003Ctd>Ethics and Corporate Etiquette\u003C/td>\n\u003Ctd>Level 5\u003C/td>\n\n\u003Ctd>15\u003C/td>\n\u003C/tr>\n\u003Ctr>\n\u003Ctd>AF5RM\u003C/td>\n\u003Ctd>Research Methods\u003C/td>\n\u003Ctd>Level 5\u003C/td>\n\n\u003Ctd>15\u003C/td>\n\u003C/tr>\n\u003Ctr>\n\u003Ctd colspan=\"3\">\u003Cstrong>Total Credits Value\u003C/strong>\u003C/td>\n\u003Ctd>105\u003C/td>\n\u003C/tr>\n\u003C/tbody>\n\u003C/table>\n\u003Cp style=\"text-align: justify;\">\u003Cstrong>Assessment Grades and Methods\u003C/strong>\u003C/p>\n\u003Cul style=\"text-align: justify;\">\n\u003Cli>Grade A- Distinction 70% and above\u003C/li>\n\u003Cli>Grade B- Credit 60% to 69%\u003C/li>\n\u003Cli>Grade C- Pass 50% to 59%\u003C/li>\n\u003Cli>Grade D- Marginal Pass 40% to 49%\u003C/li>\n\u003Cli>Grade F- Fail 39% and under\u003C/li>\n\u003C/ul>\n\u003Ctable>\n\u003Ctbody>\n\u003Ctr>\n\u003Ctd>Assessment Method\u003C/td>\n\u003Ctd>Marks\u003C/td>\n\u003C/tr>\n\u003Ctr>\n\u003Ctd>Exam\u003C/td>\n\u003Ctd>40%\u003C/td>\n\u003C/tr>\n\u003Ctr>\n\u003Ctd>Assignments\u003C/td>\n\u003Ctd>60%\u003C/td>\n\u003C/tr>\n\u003Ctr>\n\u003Ctd>Total\u003C/td>\n\u003Ctd>100%\u003C/td>\n\u003C/tr>\n\u003C/tbody>\n\u003C/table>"],"uses":{"params":["program","course"]}}]}
