{"type":"data","nodes":[null,{"type":"data","data":[{"content":1},"\n\u003Cp>\u003Cstrong>Foundation Certification in Business Management\u003C/strong>\u003C/p>\n\u003Cp>This program has been designed for those who want to achieve Professional Qualification and then further to the Professional and Advanced Professional Diploma programmes. This program is designed to prepare and upgrade students without the required management and academic writing skills.\u003C/p>\n\u003Cp>Since some of the students have short falls in English language couple with academic writing skills and being fresh graduates have little knowledge and skills of management in practical sense hence this program is designated to help build the required skills and capacity to excel to the Higher National Certificate and Diploma.\u003C/p>\n\u003Cp>This program is ideal for the following:\u003C/p>\n\u003Cul>\n\u003Cli>Individuals working within business periphery\u003C/li>\n\u003Cli>Individuals interested in junior roles in the delivery of general business activities\u003C/li>\n\u003C/ul>\n\u003Cp>This is an opened qualification which does not require previous management experience and qualification but will certainly help students to develop knowledge and understanding on these areas of specialization.\u003C/p>\n\u003Cp>\u003Cstrong>Certificate Business Management Units:\u003C/strong>\u003C/p>\n\u003Cul>\n\u003Cli>Business Management\u003C/li>\n\u003Cli>Quantitative methods\u003C/li>\n\u003Cli>Information Technology\u003C/li>\n\u003Cli>Business communications\u003C/li>\n\u003Cli>Grammar and Writing Skills\u003C/li>\n\u003C/ul>\n\u003Cp>\u003Cstrong>Assessment methods:\u003C/strong>\u003C/p>\n\u003Cul>\n\u003Cli>Assignments&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 60%\u003C/li>\n\u003Cli>Exams&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 40%\u003C/li>\n\u003C/ul>\n\u003Ch6>Entry requirement:\u003C/h6>\n\u003Cul>\n\u003Cli>GCE/GCSE/WASSCE With a minimum of four credits\u003C/li>\n\u003Cli>Applicants must demonstrate competence in English Language\u003C/li>\n\u003C/ul>\n\u003Cp>\u003Cstrong>Duration\u003C/strong>: 6 months\u003C/p>\n\u003Cp>\u003Cstrong>Tuition Fees: D8,500\u003C/strong>&nbsp;including learning materials i.e. books, articles, journals etc\u003C/p>\n"],"uses":{"params":["program","course"]}}]}
